In [63]:
import pandas as pd
import numpy as np


df = pd.read_excel('default_of_credit_card_clients__courseware_version_1_21_19.xls')

In [64]:
print(df.shape) # number of lines and columns

(30000, 25)

In [65]:
print(df.columns) # nome of the columns

Index(['ID', 'LIMIT_BAL', 'SEX', 'EDUCATION', 'MARRIAGE', 'AGE', 'PAY_1',
       'PAY_2', 'PAY_3', 'PAY_4', 'PAY_5', 'PAY_6', 'BILL_AMT1', 'BILL_AMT2',
       'BILL_AMT3', 'BILL_AMT4', 'BILL_AMT5', 'BILL_AMT6', 'PAY_AMT1',
       'PAY_AMT2', 'PAY_AMT3', 'PAY_AMT4', 'PAY_AMT5', 'PAY_AMT6',
       'default payment next month'],
      dtype='object')

- Columns:
  - ID (String): Identifier
  - LIMIT_BAL(Num): Received credit in Taiwanese dollars (individual and familiar)
  - SEX(Cat): Gen (1:Man, 2:Woman)
  - EDUCATION: (1:Pos-grad,2:university,3:highSchool, 4:Another)
  - MARRIAGE: (1:Alone,2:Married,3:Another)
  - AGE: Age
  - PAY_1-6: Past payments (September - April) (-1:pontual payment,1: one month late, 2: two month late ...)
  - BILL_AMT_1-6: Value of the bill (September - April)
  - PAY_AMT_1-6: Payed value of the bill (September - April)
  - default payment next month: (1:Same method of payment, 0: Another method)

In [66]:
df.head()

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_1,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
0,798fc410-45c1,20000,2,2,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,1
1,8a8c8f3b-8eb4,120000,2,2,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,1
2,85698822-43f5,90000,2,2,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,0
3,0737c11b-be42,50000,2,2,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,0
4,3b7f77cc-dbc0,50000,1,2,1,57,-1,0,-1,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,0

In [67]:
df['ID'].nunique() # Number of unique ids 

# the number < 30000, so exists id duplicates

29687

In [68]:
id_count = df['ID'].value_counts() # groupby/count

print(id_count.head(5)) 

id_count.value_counts() # number of repetitions, index become the key (ID)

ID
7d5f3242-e1df    2
1b22b0ab-aba3    2
4cb27699-fe3f    2
91c69d1a-8732    2
bf23c70b-bf12    2
Name: count, dtype: int64

count
1    29374
2      313
Name: count, dtype: int64

In [69]:
mask_id_bt2 = id_count >= 2  # boolean mask for ids who have more tha one repetition

print(mask_id_bt2[0:5])

ids_dupe = list(id_count.index[mask_id_bt2]) # ids of duplicated ids

ids_dupe[0:5]

ID
7d5f3242-e1df    True
1b22b0ab-aba3    True
4cb27699-fe3f    True
91c69d1a-8732    True
bf23c70b-bf12    True
Name: count, dtype: bool

['7d5f3242-e1df',
 '1b22b0ab-aba3',
 '4cb27699-fe3f',
 '91c69d1a-8732',
 'bf23c70b-bf12']

In [79]:
df.loc[df['ID'].isin(ids_dupe)].head(6)

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_1,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
141,26bde6da-f148,180000,1,2,2,28,-1,-1,-1,-1,...,332,416,416,0,416,332,500,3500,832,0
196,42009c72-651f,150000,2,2,1,34,-2,-2,-2,-2,...,116,0,1500,0,0,116,0,1500,0,0
241,26bde6da-f148,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
296,42009c72-651f,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
323,73ed1381-3a3f,230000,2,2,1,28,0,0,0,-2,...,2100,767,6173,1710,1100,1000,767,6173,1000,1
340,4f95b36b-ab10,240000,2,2,2,30,-2,-2,-2,-2,...,0,92,0,92,92,0,92,0,1883,0